$('document').ready(function () {
let groupList = [  "Астахов Никита",  "Борисов Денис",  "Вдовичев Никита",  "Жирнов Никита",  "Заикин Даниил",  "Зворыкин Глеб",  "Козлова Мария ",  "Крутиков Никита",  "Лосев Антон",  "Макарова Александра",  "Муратор Тимур",  "Назаренко Екатерина",  "Никитин Артём",  "Новоселова Татьяна",  "Орлов Данил",  "Пискун Дмитрий",  "Проходцев Сергей",  "Рахманов Амир",  "Редков Максим",  "Романенко Андрей",  "Рыжков Александр",  "Семенов Александр",  "Семянников Никита",  "Степанов Константин",  "Чеснаков Максим",  "Чикилев Данил",  "Чуркин Максим",  "Широков Антон",  "Шрестха Алекс" ]  ;
let taskList = [  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "+++++++----------+++------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "++---------------++-------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------",  "--------------------------------" ]  ;
function setTasks() {
    let width = $(`.gridWrapp`).outerWidth();
    $(`.taskWrapp`).append(`<ul></ul>`);
    for (let i = 0; i < 32; i++) {
       $(`.taskWrapp ul`).append(`<li>${i+1}</li>`);
    }
    $(`.taskWrapp ul li`).css({
      'display': 'flex',
      'justify-content': 'center',
      'align-items': 'center',
      'font-size': '16px',
      'background': '#ccc'});
}
function setGrid() {
    for (let j = 0; j < 29; j++) {
      $(`.taskWrapp`).append(`<ul></ul>`);
      for (let i = 0; i < 32; i++) {
        let cl =  taskList[j][i]  == `+` ? 'liTrue' : 'liFalse';
         $(`.taskWrapp ul`).eq(j+1).append(`<li class=${cl}></li>`);
      }
    }
}
function setStudents() {
  let width = $(`.groupWrapp`).outerWidth();
  $(`.groupWrapp`).append(`<div></div>`);
  for (let i = 0; i < 29; i++) {
      $(`.groupWrapp`).append(`<div>  ${i + 1}. ${groupList[i]}</div>`);
  }
  $(`.groupWrapp div`).eq(0).css({
    'color': 'rgba(45, 45, 45, 0)',
    'background': 'transparent',
    'border-top': '0',
    'border-left': '0'})
}

setTasks();
setGrid();
setStudents();
});
